$(function(){

    /*-------------------------------------------------------表格初始化----------------------------*/

    var col = [

        {
            title:'工单号',
            data:'GDH'
        },
        {
            title:'工单状态',
            data:'GDZT'
        },
        {
            title:'维修班组',
            data:'WXBZ'
        },
        {
            title:'维修事项',
            data:'WXSX'
        },
        {
            title:'报修科室',
            data:'BXKS'
        },
        {
            title:'报修时间',
            data:'BXSJ'
        },
        {
            title:'故障位置',
            data:'GZWZ'
        },
        {
            title:'故障描述',
            data:'GZMS'
        },
        {
            title:'维修备注',
            data:'WXBZH'
        },
        {
            title:'报修人',
            data:'BXR'
        },
        {
            title:'关单人',
            data:'GDR'
        },
        {
            title:'维修人',
            data:'WXR'
        },
        {
            title:'评价',
            data:'PJ'
        },
        {
            title:'完工时间',
            data:'WGSJ'
        }

    ]

    _tableInit($('.table'),col,1,true,'','','','');

    var arr = [

        {
            "GDH":"18070709015832",
            "GDZT":"执行中",
            "WXBZ":"设备维修科",
            "WXSX":"密码盒松动按键不灵",
            "BXKS":"爱玛客",
            "BXSJ":"2018-07-05 18:24:56",
            "GZWZ":"4号楼2楼",
            "GZMS":"密码盒松动按键不灵",
            "WXBZH":"派给陈天任",
            "BXR":"游久云",
            "GDR":"",
            "WXR":"陈天任",
            "PJ":"",
            "WGSJ":""

        },
        {
            "GDH":"18070511273857",
            "GDZT":"执行中",
            "WXBZ":"设备维修科",
            "WXSX":"肝胆4床电视坏",
            "BXKS":"后勤处（物业）",
            "BXSJ":"2018-07-05 11:27:38",
            "GZWZ":"5号楼5楼",
            "GZMS":"肝胆4床电视坏",
            "WXBZH":"",
            "BXR":"刘丹",
            "GDR":"",
            "WXR":"孙平",
            "PJ":"",
            "WGSJ":""

        },
        {
            "GDH":"18070511263604",
            "GDZT":"执行中",
            "WXBZ":"设备维修科",
            "WXSX":"血二55床电视坏",
            "BXKS":"后勤处（物业）",
            "BXSJ":"2018-07-05 11:26:36",
            "GZWZ":"6号楼",
            "GZMS":"血二55床电视坏",
            "WXBZH":"",
            "BXR":"刘丹",
            "GDR":"",
            "WXR":"汪波",
            "PJ":"",
            "WGSJ":""

        },
        {
            "GDH":"18070511263604",
            "GDZT":"执行中",
            "WXBZ":"爱玛客",
            "WXSX":"长期在过道充电停留，影响消防通道！",
            "BXKS":"保卫科",
            "BXSJ":"2018-07-05 10:47:42",
            "GZWZ":"1号楼2楼",
            "GZMS":"长期在过道充电停留，影响消防通道！",
            "WXBZH":"",
            "BXR":"	赵应刚",
            "GDR":"",
            "WXR":"	陈丽",
            "PJ":"",
            "WGSJ":""

        },
        {
            "GDH":"18070418261183",
            "GDZT":"执行中",
            "WXBZ":"后勤处（物业）",
            "WXSX":"6号楼手术梯里面电话故障，已告知肖宗成与医院宋启华",
            "BXKS":"爱玛客",
            "BXSJ":"2018-07-04 18:26:11",
            "GZWZ":"6号楼",
            "GZMS":"6号楼手术梯里面电话故障，已告知肖宗成与医院宋启华",
            "WXBZH":"",
            "BXR":"	刘莉莉",
            "GDR":"",
            "WXR":"	高霞",
            "PJ":"",
            "WGSJ":""

        },
        {
            "GDH":"18070418261183",
            "GDZT":"执行中",
            "WXBZ":"爱玛客",
            "WXSX":"清理掉落外墙砖",
            "BXKS":"水电班",
            "BXSJ":"2018-07-04 15:02:09",
            "GZWZ":"1号楼1楼大门口及光大银行侧面处",
            "GZMS":"清理掉落外墙砖",
            "WXBZH":"没培训过迈，派到水电班来了",
            "BXR":"张顺实",
            "GDR":"",
            "WXR":"张静",
            "PJ":"",
            "WGSJ":""

        },
        {
            "GDH":"18070710482888",
            "GDZT":"待关单",
            "WXBZ":"设备监控组",
            "WXSX":"空调-其他",
            "BXKS":"分院门诊部",
            "BXSJ":"2018-07-07 10:42:24",
            "GZWZ":"1号楼1层便民服务中心",
            "GZMS":"之前空调漏水来进行了维修，但是维修后，目前空调噪音特别大，严重影响工作。",
            "WXBZH":"已处理",
            "BXR":"高彰骐",
            "GDR":"",
            "WXR":"李佳奇",
            "PJ":"",
            "WGSJ":"2018/7/7 11:07:19"

        },
        {
            "GDH":"18063007361540",
            "GDZT":"待关单",
            "WXBZ":"爱玛客",
            "WXSX":"5号楼边梯故障，已报修吴迪",
            "BXKS":"爱玛客",
            "BXSJ":"2018-06-30 07:36:15",
            "GZWZ":"5号楼",
            "GZMS":"5号楼边梯故障，已报修吴迪",
            "WXBZH":"已恢复正常",
            "BXR":"刘莉莉",
            "GDR":"",
            "WXR":"刘莉莉",
            "PJ":"",
            "WGSJ":"2018/6/30 12:56:49"

        },
        {
            "GDH":"18062921203574",
            "GDZT":"待关单",
            "WXBZ":"设备监控组",
            "WXSX":"分子中心需送两瓶二氧化碳",
            "BXKS":"后勤处（物业）",
            "BXSJ":"2018-06-29 21:20:35",
            "GZWZ":"7号楼三楼",
            "GZMS":"分子中心需送两瓶二氧化碳",
            "WXBZH":"己送",
            "BXR":"调度值班",
            "GDR":"",
            "WXR":"陈代国",
            "PJ":"",
            "WGSJ":"2018/6/30 9:06:43"

        }
    ]

    _datasTable($('.table'),arr);



})