/**
 * Created by admin on 2018/11/14.
 */
$(function(){

    changeStringToArr($('#scrap-datatables'),xiajiArr1);

    //点击切换夏季按钮
    $('.switch-btn-container span').on('click',function(){

        //获取当前索引
        var index = $(this).index();

        $(this).parents('body').find('.switch-btn-container span').removeClass('onChoose');

        $(this).addClass('onChoose');

        //获取当前数据数组
        var thisDataArr = xiajiAllDataArr[index];

        var dom = $('#scrap-datatables');

        if($(this).attr('data-type') == 1){

            thisDataArr = dongjiAllDataArr[index];

             dom = $('#scrap-datatables1');
        }

        $('.table-fixation').hide();

        dom.show();

        //获取当前名称
        var thisName = $(this).html();

        $('.main-contents-table .title').html(thisName);

        changeStringToArr(dom,thisDataArr);
    });

});


//夏季供冷平日数据
var xiajiArr1 = [
    '6:00,开站,所有设备,开启,1#离心机、2#离心机,1,8,6,150,室外湿球+2,5',
    '7:00,人流一般,所有设备,开启,1#离心机、2#离心机,1,7.5,5,150,室外湿球+2,5',
    '9:00,人流较多,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '14:00,室外温度高,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '16:00,人流高峰,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '18:00,人流较多,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '20:00,人流一般,所有设备,开启,1#离心机、2#离心机,1,8,6,150,室外湿球+2,5',
    '23:00,闭站,所有设备,关闭,1#离心机、2#离心机,0,——,——,——,——,——'
];

//夏季供冷节假日数据
var xiajiArr2 = [
    '6:00,开站,所有设备,开启,1#离心机、2#离心机,2,7.5,6,150,室外湿球+2,5',
    '7:00,人流较多,所有设备,开启,1#离心机、2#离心机,2,7,5,150,室外湿球+2,5',
    '9:00,人流较多,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '14:00,室外温度高,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '16:00,人流高峰,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '18:00,人流较多,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '20:00,人流较多,所有设备,开启,1#离心机、2#离心机,1,7.5,6,150,室外湿球+2,5',
    '23:00,闭站,所有设备,关闭,1#离心机、2#离心机,0,——,——,——,——,——'
];

//过渡季供冷平日数据
var xiajiArr3 = [
    '6:00,开站,所有设备,开启,1#离心机、2#离心机,1,9,6,150,室外湿球+2,5',
    '7:00,人流一般,所有设备,开启,1#离心机、2#离心机,1,8,5,150,室外湿球+2,5',
    '9:00,人流较多,所有设备,开启,1#离心机、2#离心机,1,8,5,200,室外湿球+2,5',
    '14:00,室外温度高,所有设备,开启,1#离心机、2#离心机,2,7.5,5,200,室外湿球+2,5',
    '16:00,人流高峰,所有设备,开启,1#离心机、2#离心机,2,7.5,5,200,室外湿球+2,5',
    '18:00,人流较多,所有设备,开启,1#离心机、2#离心机,1,8,5,200,室外湿球+2,5',
    '20:00,人流一般,所有设备,开启,1#离心机、2#离心机,1,9,6,150,室外湿球+2,5',
    '23:00,闭站,所有设备,关闭,1#离心机、2#离心机,0,——,——,——,——,——'
];

//过渡季供冷节假日数据
var xiajiArr4 = [
    '6:00,开站,所有设备,开启,1#离心机、2#离心机,1,9,6,150,室外湿球+2,5',
    '7:00,人流一般,所有设备,开启,1#离心机、2#离心机,1,8,5,150,室外湿球+2,5',
    '9:00,人流较多,所有设备,开启,1#离心机、2#离心机,2,7.5,5,200,室外湿球+2,5',
    '14:00,室外温度高,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '16:00,人流高峰,所有设备,开启,1#离心机、2#离心机,2,7,5,200,室外湿球+2,5',
    '18:00,人流较多,所有设备,开启,1#离心机、2#离心机,1,7.5,5,200,室外湿球+2,5',
    '20:00,人流一般,所有设备,开启,1#离心机、2#离心机,1,9,6,150,室外湿球+2,5',
    '23:00,闭站,所有设备,关闭,1#离心机、2#离心机,0,——,——,——,——,——'
];


//冬季供热平日数据
var dongjiArr1 = [
    '6:00,开站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,6,50,10,200',
    '7:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,5,45,10,200',
    '9:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,5,45,10,200',
    '14:00,室外温度高,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,40,10,180',
    '16:00,人流高峰,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,45,10,200',
    '18:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,45,10,200',
    '20:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,50,10,200',
    '23:00,闭站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,2,35,15,150'
];

//冬季供热节假日数据
var dongjiArr2 = [
    '6:00,开站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,6,50,10,200',
    '7:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,5,45,10,200',
    '9:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,5,42,10,200',
    '14:00,室外温度高,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,40,10,180',
    '16:00,人流高峰,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,42,10,200',
    '18:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,45,10,200',
    '20:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,50,10,200',
    '23:00,闭站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,2,35,15,150'
];

//过渡季供热节假日数据
var dongjiArr3 = [
    '6:00,开站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,50,10,200',
    '7:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,45,10,200',
    '9:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,42,10,200',
    '14:00,室外温度高,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,40,10,180',
    '16:00,人流高峰,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,42,10,200',
    '18:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,45,10,200',
    '20:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,50,10,200',
    '23:00,闭站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,1,35,15,150'
];

//过渡季供热节假日数据
var dongjiArr4 = [
    '6:00,开站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,50,10,200',
    '7:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,45,10,200',
    '9:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,42,10,200',
    '14:00,室外温度高,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,40,10,180',
    '16:00,人流高峰,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,42,10,200',
    '18:00,人流较多,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,3,45,10,200',
    '20:00,人流一般,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,4,50,10,200',
    '23:00,闭站,所有设备,开启,1#罐、2#罐、3#罐、4#罐、5#罐、6#罐,1,35,15,150'
];



//存放夏季数据的数组
var xiajiAllDataArr = [xiajiArr1,xiajiArr2,xiajiArr3,xiajiArr4];

//存放冬季数据的数组
var dongjiAllDataArr = [dongjiArr1,dongjiArr2,dongjiArr3,dongjiArr4];



//把字符数据转为数组 并赋值给页面
function changeStringToArr(dom,dataArr){

    var newDataArr = [];

    $(dataArr).each(function(i,o){

        var dataArr = o.split(',');

        newDataArr.push(dataArr);

    });

    //定义赋值给页面的字符串
    var tableHtml = '';

    $(newDataArr).each(function(i,o){

        tableHtml += '<tr>';

        $(o).each(function(i,o){

            tableHtml +='<td>'+o+'</td>'

        });


        tableHtml += '</tr>';

    });

    dom.find('tbody').html(tableHtml);

}